In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
data = [4, 7, -5, 3]
index = ["a", "b", "c", "d"] # index를 수정해 표 내용 수정 가능
pd_data = pd.Series(data)
pd_data2 = pd.Series(data, index)
print(pd_data2)
print(pd_data2["c"]) # 해당 행의 데이터 추출

a    4
b    7
c   -5
d    3
dtype: int64
-5

In [4]:
pd_data2[pd_data2>0] # 데이터 정제

a    4
b    7
d    3
dtype: int64

In [5]:
pd_data2*2 # 데이터 정제 2

a     8
b    14
c   -10
d     6
dtype: int64

In [6]:
"b" in pd_data2 # 데이터 (index) 내용 검증

True

In [7]:
"e" in pd_data2 # 데이터 (index) 내용 검증

False

In [8]:
ser_data = {"Ohia":35000, "Texas":71000, "Oregon":16000, "Utah":5000}
pd_data3 = pd.Series(ser_data)
pd_data3

Ohia      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [9]:
ser_data = {"Ohia":35000, "Texas":71000, "Oregon":16000, "Utah":5000}
index = ["California", "Ohia", "Oregon", "Utah"] # 전처리 과정 index 수정하기
pd_data4 = pd.Series(ser_data, index)
pd_data4

California        NaN
Ohia          35000.0
Oregon        16000.0
Utah           5000.0
dtype: float64

In [10]:
# pandas의 누락된 데이터 검색
pd.isnull(pd_data4)

California     True
Ohia          False
Oregon        False
Utah          False
dtype: bool

In [11]:
pd.notnull(pd_data4)

California    False
Ohia           True
Oregon         True
Utah           True
dtype: bool

In [51]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame # frame.head(n) n개 만큼 표기, 디폴트는 5개 / frame.tail 도 가능

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2003  2.9

In [52]:
frame2 = pd.DataFrame(data, columns=['year','state','sales', 'pop'],
             index = ["No1", "No2", "No3", "No4", "No5"])
frame2

     year   state sales  pop
No1  2000    Ohio   NaN  1.5
No2  2001    Ohio   NaN  1.7
No3  2002    Ohio   NaN  3.6
No4  2001  Nevada   NaN  2.4
No5  2003  Nevada   NaN  2.9

In [53]:
frame2['pop']

No1    1.5
No2    1.7
No3    3.6
No4    2.4
No5    2.9
Name: pop, dtype: float64

In [54]:
frame2.loc["No4"]

year       2001
state    Nevada
sales       NaN
pop         2.4
Name: No4, dtype: object

In [55]:
frame2['sales'] = np.arange(5)
frame2

     year   state  sales  pop
No1  2000    Ohio      0  1.5
No2  2001    Ohio      1  1.7
No3  2002    Ohio      2  3.6
No4  2001  Nevada      3  2.4
No5  2003  Nevada      4  2.9

In [56]:
frame2['sales'] = [100, 200, 300, 400, 500]
frame2

     year   state  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2003  Nevada    500  2.9

In [57]:
ser = pd.Series([100, 200, 300, 400, 500])
ser

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [58]:
frame2

     year   state  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2003  Nevada    500  2.9

In [59]:
index = ["No1","No2","No3","No4","No5"]
ser = pd.Series([100, 200, 300, 400, 500], index)
frame2['sales'] = ser
frame2

     year   state  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2003  Nevada    500  2.9

In [60]:
frame2['eastern'] = frame2.sales
frame2

     year   state  sales  pop  eastern
No1  2000    Ohio    100  1.5      100
No2  2001    Ohio    200  1.7      200
No3  2002    Ohio    300  3.6      300
No4  2001  Nevada    400  2.4      400
No5  2003  Nevada    500  2.9      500

In [61]:
del frame2['eastern']
frame2
#index(['year', 'state', 'pop', 'sales'], dtype='object')

     year   state  sales  pop
No1  2000    Ohio    100  1.5
No2  2001    Ohio    200  1.7
No3  2002    Ohio    300  3.6
No4  2001  Nevada    400  2.4
No5  2003  Nevada    500  2.9

In [62]:
pop_data = {
    'Nevada':{ 2001: 2.4, 2002:2.9, 2003:3.9},
    'Ohio':{ 2000:1.5, 2001:1.7, 2002:3.6}
}
frame2 = pd.DataFrame(pop_data)
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     3.9   NaN
2000     NaN   1.5

In [63]:
frame2.T

        2001  2002  2003  2000
Nevada   2.4   2.9   3.9   NaN
Ohio     1.7   3.6   NaN   1.5

In [64]:
frame2 = pd.DataFrame(pop_data, index=[2000, 2001, 2002, 2003])
frame2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     3.9   NaN

In [65]:
frame2.index.name = 'year'
frame2.columns.name = 'state'
frame2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      3.9   NaN

In [66]:
frame2.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [67]:
frame2.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6],
       [3.9, nan]])

In [68]:
frame2

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      3.9   NaN

In [69]:
frame3 = frame2.reindex([2000, 2001, 2002, 2003, 2004])
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6
2003      3.9   NaN
2004      NaN   NaN

In [71]:
frame4 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
print(frame4)
frame5 = frame4.reindex(index=[0, 1, 2, 3, 4], method='ffill') # 기준 없이 데이터 채우는건 의미 없음
print(frame5) # 시계열데이터, 인접 데이터와 관련있는 내용 채우기에 적합

0      blue
2    purple
4    yellow
dtype: object
0      blue
1      blue
2    purple
3    purple
4    yellow
dtype: object

In [44]:
frame4.reindex(range(6), method='ffill')
print(frame4)

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [72]:
frame5 = frame2.reindex(columns=["네바다","오하이오"])
frame5

state  네바다  오하이오
year
2000   NaN   NaN
2001   NaN   NaN
2002   NaN   NaN
2003   NaN   NaN

In [73]:
new_frame5 = frame5.drop(2001)
new_frame5

state  네바다  오하이오
year
2000   NaN   NaN
2002   NaN   NaN
2003   NaN   NaN